[
    "The original Nintendo Entertainment System had a resolution of 256 x 224 pixels. In comparison, the Nintendo Switch can run games at 1920 x 1080.",
    "The Light Gun that was included with some Nintendo Entertainment Systems does not work on modern HDTV screens due to image processing causing a display lag of about 20 to 50 milliseconds.",
    "The PlayStation was able to render textures with about 700kb of video memory. The N64 only had 4kb, resulting in more cartoony styled games and clever programming tricks to add detail to the environment.",
    "The N64 had 4 MB of RAM compared to the PlayStation's 2 MB, allowing for larger 3D worlds, better draw distances, and higher resolution.",
    "Around 650 MB of data could fit on a PlayStation CD, as opposed to about 64 MB on an N64 cartridge. This usually led to movie-style cutscenes, higher quality music, and voice acting on the PlayStation.",
    "The most valuable NES game today is _Nintendo World Championships_ Gold. Only 26 copies were produced and given out by Nintendo in 1990 as a contest prize. It has sold for more than $25,000.",
    "The highest grossing arcade game of all time, not considering inflation, is _Space Invaders_, estimated to have earned $2.7 billion in quarters between 1978 and 1982.",
    "Nintendo offered repair service for the original GameBoy, released in 1989, until 2007.",
    "When _Space Invaders_ was released in Japan, it caused a temporary shortage of the 100 yen coin.",
    "Mario first appeared in 1981 as the playable character in Nintendo's arcade game _Donkey Kong_. However, he was a carpenter known only as Jumpman.",
    "_NBA Jam_ creator Mark Turmell, a Pistons fan, admitted that there is special code in the game that diminishes the Bulls' chances of making a last second shot.",
    "The _Final Fantasy_ series is so named because the developer, Square Enix, was going bankrupt and it was thought this could be their last game. However, it was a massive success and has led to over 15 installments and spin-offs.",
    "In the original _Civilization_ game, Gandhi's aggression rating began at the lowest setting of 1. If it was lowered, a bug caused it to loop around to the maximum of 255, turning Gandhi into a nuke-flinging warmonger.",
    "_Pac-Man_ was originally going to be called _Puck-Man_ in the United States, but that was changed after considering how easy it would be to vandalize the arcade cabinets to say something else.",
    "A cheat code giving the player all power ups was inserted into the game _Gradius_ by the developers for testing purposes, and was left in upon release. The Konami Code, as it is now called, has made appearances in many games since.",
    "_Ice Climber_ was the first game that Kazuaki Morita worked on. He would go on to refine the game's formula for his next title at Nintendo: _Super Mario Bros_.",
    "_Balloon Fight_ was one of the first games Satoru Iwata worked on at Nintendo. He later went on to become president and CEO of the company, and oversaw the launches of the Nintendo DS and Wii.",
    "_Metroid_ and _Kid Icarus_ were both developed by the same team at Nintendo.",
    "_Ninja Gaiden_ was the first console game to have the story presented with cinematic cutscenes.",
    "In _The Legend of Zelda_, the player character was originally envisioned to be able to travel throughout time periods with the help of the Triforce. Thus he was named Link after his connection between the eras.",
    "According to a calendar in Nintendo Power volume 2, Mario's birthday is October 11.",
    "Nintendo was founded in 1889 as a playing card and toy manufacturer.",
    "In the original _Super Mario Bros._ for NES, the clouds and bushes are the same graphic.",
    "The console that was to be the SNES sequel was a originally a collaboration between Nintendo and Sony. However, Nintendo backed out of the deal leading Sony to independently develop what would become the PlayStation.",
    "At its release in 1996, the N64 had only two games: _Super Mario 64_ and _Pilotwings 64_.",
    "The look of _Donkey Kong Country_ was achieved through use of rasterization: the graphics were rendered in 3D on a more powerful system, then converted into 2D for the 16-bit SNES.",
    "In 1982, the arcade video game industry's revenue in quarters was estimated at $8 billion, surpassing the annual revenue of pop music ($4 billion) and Hollywood films ($3 billion) combined.",
    "_Zaxxon_, released in by Sega in 1982, was the first game to feature isometric graphics.",
    "_Space Invaders_, manufactured in 1978 by Taito, was the first game to include a continuous background soundtrack, even though it was comprised of only four notes that changed pace with the stage.",
    "The first game to feature true background music was Namco's _Rally-X_ in 1980.",
    "The graphic finishing moves known as 'Fatalities' in Midway's _Mortal Kombat_ led to the creation of the Entertainment Software Rating Board to give age-appropriate content ratings for video games.",
    "Donkey Kong, Mario, and Princess Peach are based on characters from the cartoon series Popeye. Nintendo created them after they failed to obtain a license to make a Popeye video game.",
    "The Sega Dreamcast was the first console to implement online play over a phone line, calling the system Sega Net.",
    "Popular Science recognized the Sega Dreamcast as one of the most important and innovative products of 1999.",
    "The Magnavox Odyssey, released in 1972, contained 40 transistors and no microprocessor. In comparison, the Pentium 4 microprocessor contains 42 million transistors on the chip itself.",
    "The N64 marked the first time that computer graphics workstation manufacturer Silicon Graphics Inc. (SGI) developed game hardware technology.",
    "The Atari _Pong_ video game console was the No. 1 selling item for the holiday season in 1975.",
    "The first console to have games available in the form of add-on cartridges was the Fairchild Channel F console, introduced in August 1976.",
    "On the original Magnavox Odyssey, players had to keep score themselves because the machine couldn't.",
    "On the market from 1991 till 2004, the SNK NeoGeo AES has tied the Atari 2600 (1977-1990) as the longest supported gaming console in history.",
    "The Sega Megadrive/Genesis featured a version of the same Motorola processor that powered the original Apple Macintosh computer.",
    "Mattel's Intellivison system, introduced in 1980, featured an add-on called 'PlayCable', which delivered games by cable TV.",
    "Nintendo's Game Boy was the most successful game system ever, with more than 100 million units sold worldwide.",
    "The word 'Atari' comes from the ancient Japanese game of Go and means _You are about to be engulfed._ Technically, it is the word used by a player to inform his opponent that he is about to lose, similar to _check_ in chess.",
    "In the 1980s, a service called Gameline allowed users to download games to the Atari 2600 over regular phone lines. It was not a success, but did form part of the foundation for America Online, the world's largest Internet service provider.",
    "The first color portable video game system was the Atari Lynx, introduced in 1989 and priced at $149.",
    "Introduced in 1993, the 3DO was the first video game system to be based entirely on CD technology.",
    "The PlayStation was originally intended as a CD add-on to the Super Nintendo. When licensing problems and other issues arose, Sony decided to develop the PlayStation as a machine of its own.",
    "DMA Designs is a company best known for _Lemmings_ – or at least, they were. After creating _Body Harvest_ for the Nintendo 64, DMA became Rockstar North and produced _Grand Theft Auto III_.",
    "If you look hard enough, you can spot _Pac-Man_ in the Disney movie Tron.",
    "_Pac-Man_ creator Toru Iwatani revealed that the character was designed to appeal to women.",
    "_Sonic the Hedgehog_ originally had a human girlfriend named Madonna.",
    "_E.T. - The Extra Terrestrial_ for Atari 2600 actually sold more than Space Invaders. E.T. moved 1.5 million units, while Space Invaders only moved 1 million.",
    "Jen Taylor, who has voiced Princess Peach and Toad in several Mario games is also Halo's female lead, Cortana.",
    "Ryo Hazuki, _Shenmue_'s protagonist, had a bicycle in early development to quickly traverse town.",
    "In _Super Mario 64_, Boo's laugh is actually a sped up version of Bowser's laugh.",
    "_GunValkyrie_ was originally developed as a Dreamcast game, and was supposed to be played with a controller and light gun at the same time.",
    "_The Legend of Zelda_'s beta version gives players the choice between a sword and a boomerang at the beginning.",
    "_Street Fighter II_ names didn't fully translate from Japan to North America. In the states, M. Bison is Balrog, Vega is M. Bison, and Balrog is Vega.",
    "Tingle from the _The Legend of Zelda_ series looks suspiciously like series composer Koji Kondo.",
    "In _Pokémon Red & Blue_ versions, the three legendary birds Arcticuno, Zapdos and Moltres actually mean _One, Two, Three_ in Spanish. Artic-UNO, Zap-DOS, Mol-TRES.",
    "The music from _Super Mario Bros. 3_'s water world is the same as the fairy music from _The Legend of Zelda: Ocarina of Time_.",
    "NES title _Snake Rattle 'n' Roll_ gives a shout-out to another platform by spelling out _GAMEBOY_ in the ground's tiles.",
    "_Sonic the Hedgehog_'s debug mode reveals an unused item – air goggles. These goggles would allow Sonic to breathe underwater.",
    "Ooccoo, the dungeon-warping bird in _The Legend of Zelda: Twilight Princess_, has a strange connection with Link. _00CC00_ is the hexadecimal code for the green in Link's tunic in _The Legend of Zelda_.",
    "Link was originally planned to be in the Wii version of _Marvel: Ultimate Alliance_.",
    "Pokémon was inspired by butterflies. Satoshi Tajiri, the series' creator, used to collect caterpillars and watched them turn into butterflies as a kid.",
    "Lara Croft's breast size was actually an accident. The developers wanted to increase her breast size by 50%, but accidentally increased it by 150%.",
    "The maximum score anyone can achieve in _Pac-Man_ is 3333360.",
    "Mario actually doesn't hit the bricks with his head, but actually punches them, if looked closely.",
    "_Devil May Cry_ started out as a failed _Resident Evil_ game.",
    "If you name yourself Zelda instead of Link in _The Legend of Zelda_, you will be able to skip the first quest entirely.",
    "_Sonic the Hedgehog_'s first appearance in any video game ever was as an air fresher emblem in the Sega video game Rad Mobile.",
    "Link, from _The Legend of Zelda_, was directly inspired by Peter Pan, according to its designer, Shigeru Miyamoto.",
    "The 3DO cost a staggering $700 during its 1993 launch, equivalent to over $1200 today.",
    "_Lemmings_ is one of the most widely ported games, receiving official releases for 25 platforms.",
    "The 1976 Atari game _Breakout_ was created by Apple co-founders Steve Jobs and Steve Wozniak.",
    "The second player controller on the Famicom lacked Start and Select buttons, but included a microphone.",
    "The Commodore 64 is the best-selling single computer model of all time with over 17 million units sold.",
    "_Tetris_ is the best-selling video game of all time with over 170 million copies sold across dozens of platforms.",
    "_Pac-Man_ is the best-selling arcade game with over 400,000 cabinets sold.",
    "Due to their cultural impact, _Dragon's Lair_, _Pac-Man_, and _Pong_ are the only three video games on permanent display at the Smithsonian Institution in Washington, D.C., USA.",
    "Sega's 1991 FMV game _Time Traveler_ is the first arcade game to feature a holographic display.",
    "Sega's 1983 rail shooter _Astron Belt_ was the first laserdisc video game, being released just over a month before the more popular _Dragon's Lair_.",
    "The first commercially available, coin-operated arcade game machine was released in 1971 and, no!, it wasn't Pong. It was *Computer Space*. See how it looks: <https://www.youtube.com/watch?v=b3BQsCCwo8w>",
    "The CVC GameLine cartridge made it possible to download games via phoneline for the Atari 2600 in 1983, over 20 years earlier than services like Xbox Live Arcade.",
    "The Atari 2600 was the first video game console to have wireless controllers. The Atari CX-42 joystick controllers used radio waves to transmit information, and they released in 1983.",
    "The CVC GameLine cartridge made it possible to download games via phoneline for the Atari 2600 in 1983, over 20 years earlier than services like Xbox Live Arcade.",
    "Due to South Korea banning Japanese cultural imports at the end of World War II, the Game Gear was distributed by South Korean company Samsung, and was named the Handy Gam*Boy.",
    "The Genesis was the first SEGA console to have online play, but it was only compatible with a handful of games and the lifespan for the modem device was less than one year.",
    "Since the Super Nintendo wasn't powerful enough to emulate a GameBoy with software, the Super GameBoy actually contained all the hardware of a regular GameBoy except for the screen and buttons.",
    "Clive Sinclair was knighted in 1983 for the creation of the ZX Spectrum and how its significance greatly contributed to the British industry.",
    "Die Hard Arcade for the Sega Saturn was originally going to be Streets of Rage 4.",
    "There is a ZX Spectrum emulator in the code of Goldeneye 007 (N64).",
    "In the original Space Invaders, the invaders speeding up as you destroy them isn't programmed. The game's creator, Tomohiro Nishikado discovered that the more enemies that were removed from play, the faster the processor could render those that remained. Rather than attempt to design the game to compensate for the speed increase, he opted to leave it in as a challenging gameplay mechanic.",
    "Apple released a console called the Apple Bandai Pippin in 1995, it failed miserably.",
    "Sonic can't swim because the employees at Sega believed that Hedgehogs couldn't swim.",
    "_Mary Kate & Ashley Get a Clue_ (GBC) was originally meant to be a South Park game.",
    "_Conker's Bad Fur Day_ (N64) was originally going to be Twelve Tales: Conker 64, but due to a lot of people making fun of Rare for making too many kid-friendly platformers, Rare re-worked it into the M-rated comedy platformer, with Conker becoming an alcoholic, foul-mouthed squirrel we know and love today.",
    "The infamous Turbo Tunnel speeder bike stage from _Battletoads_ (NES) is actually one of the easiest in the game. In fact, there are three other racing-style levels in the game — Surf City, Volkmire’s Inferno and Clinger Winger — and they’re all significantly harder than the Turbo Tunnel.",
    "Zelda (_Legend of Zelda_: NES) was named after Zelda Fitzgerald, wife of “Great Gatsby” author F. Scott Fitzgerald. Miyamoto says he wanted the game’s princess to have a mysterious quality and Mrs. Fitzgerald fit the bill perfectly.",
    "Link (_Legend of Zelda_: NES) is left-handed in every game until the Wii versions were released that featured a right-handed Link to accommodate the right-handed noobs and their Wiimotes.",
    "The Dracula-based video game _Castlevania_ (NES) is particularly valuable these days. Sealed versions of the game sell for upwards of $900, depending on the condition. Original Nintendo NES editions of _Castlevania_ and _Castlevania 2_ have sold for more than $950.",
    "The end of _Double Dragon II: The Revenge_ differs on both the NES and arcade. **`[SPOILER ALERT!]`**: On the NES, damsel-in-distress Marian is brought back to life after being killed early in the story; the arcade version ends on a much more dour note, leaving her dead.",
    "_Ninja Gaiden_'s (NES) director, Hideo Yoshizawa (credited as Sakurazaki), wanted the NES version of the game to have a much deeper story than the arcade version, so he implemented 20 minutes of cinematic cutscenes. Though standard now, a story told through cutscenes was revolutionary at the time.",
    "When gaming site Kotaku asked Miyamoto if he’s ever made a bad game, the designer responded that _Zelda II: The Adventure of Link_ didn’t live up to his expectations. \"We could have done more with [Link],\" he said. \"It would have been nice to have had bigger enemies in the game, but the [NES] hardware wasn't capable of doing that.\"",
    "Not only is _Ghosts'n Goblins_ (NES) known as one of the hardest games of all time, you actually have to beat it twice to actually complete it (it turns out the first play-through is all just a dream for the player).",
    "When _Yoshi's Island_’s producer - and Mario creator - Shigeru Miyamoto unveiled the game to the company, his brightly colored, cartoony graphics were rejected by the marketing department. They wanted something more akin to what developer Rare did with Donkey Kong, not the type of visuals that Miyamoto was going for. Miyamoto doubled-down on his vision, retooling Yoshi’s Island’s visuals to become even more colorful and exaggerated, almost like illustrations you would find in a storybook. Oddly enough, this second pitch was accepted, leading to one of the console’s most successful games, topping out at around 4 million units sold.",
    "Rhydon was the first Pokémon to ever be created in _Pokémon Red & Blue_ (GB), having an Index Number of 01 if you look into the game's code. Kangaskhan was the second.",
    "There's a scene on the Super Mario Bros. film (1993) where the characters say that their last name is Mario, therefore fullnames are Mario Mario and Luigi Mario (the Mario Bros.). But in an interview to gameinformer Shigeru Miyamoto said \"Mario is really just Mario and Luigi is really just Luigi\". Source: <https://www.gameinformer.com/b/features/archive/2015/09/10/miyamoto-tezuka-interview.aspx> Movie scene: <https://youtu.be/7MNEF7kjf9s>",
    "_Worms_ (1995) was originally called \"Total Wormage!\", a play on a Midway arcade game Total Carnage. Source: <https://www.youtube.com/watch?v=08C-ttHHKFs>",
    "The selfie was basically invented through the Game Boy. A Game Boy digital camera with a thermal printer was released in 1998, making it possible for players to take pictures of themselves and print them.",
    "The cover of the Neil Young album \"Silver and Gold\" was taken with a Game Boy Camera.",
    "Nintendo reached older audience by dropping the \"boy\" element (from Game Boy) in Nintendo DS, according to US Gamer.",
    "Kazumi Totaka includes a 19 note melody in every game where he is credited in a music-related role. \"Totaka's Song\" was first discovered in _Mario Paint_ (SNES), but it's first appearance in _X_ (GB) wasn't discovered until 15 years after it's 1992 release. It has yet to be found in _Wave Race 64_ (N64), _Wii Sports_ (Wii), _Wii Music_ (Wii), and _Healthy Recipe Assistant 1000: DS Menu Anthology_ (NDS).\nSee some of Totaka's song appearance here: https://www.youtube.com/watch?v=yc_xm9Tm51I"
]
